# 「こんにちは、Ruby」と出力してください
puts "こんにちは、ruby"

# 以下の行をコメントにしてください
#puts "Hello Ruby"

# 数値の37を出力してください
puts 37

# 「+」を用いて、2に9を足した値を出力してください

puts 2 + 9
# 文字列「2 + 9」を出力してください
puts "2+9"
# 「*」を用いて、13に9を掛けた値を出力してください
puts 13*9

# 「/」を用いて、32を8で割った値を出力してください
puts 32/8

# 「%」を用いて、18を5で割った余りを出力してください
puts 18%5

puts "Q4"
# 「私は」と「にんじゃわんこです」を連結して出力してください
puts "私は" + "にんじゃわんこです"

# 文字列の「38」と「19」を連結して出力してください
puts "38" + "19"

puts "Q5"
# 変数nameに、文字列「にんじゃわんこ」を代入してください
name = "にんじゃわんこ"

# 変数nameを出力してください

puts name

puts "Q6"
text = "プログラミングを学ぼう"

# 文字列「Progateで」と変数textを連結して、出力してください
puts "progateで" + text

length = 8
width = 9

# 変数lengthと変数widthを掛けて出力してください

puts length*width